# Задача №1. Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.


# number1 = int(input("Введите значение:"))  

# if number1 == 6 or number1 == 7: print("Это выходной день")
# else: 
#     print("Этот день не выходной")


# Задача №2 Напишите программу для. проверки истинности утверждения 
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# Задача №3. Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка 
# (или на какой оси она находится).

# x = int(input("Введите х:"))
# y = int(input("Введите y:"))

# if x > 0 and y > 0: print("Первая четверть")
# if x > 0 and y < 0: print("Вторая четверть")
# if x < 0 and y < 0: print("Третья четверть")
# if x < 0 and y > 0: print("Четвертая четверть")


# Задача №4. Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# chetvert = int(input("Введите номер четверти:"))
# if chetvert == 1: print("Диапазон возможных координат: х от 0 до бесконечности, у от 0 до бесконечности")
# if chetvert == 2: print("Диапазон возможных координат: х от 0 до бесконечности, у от 0 до  минус бесконечности")
# if chetvert == 3: print("Диапазон возможных координат: х от 0 до минус бесконечности, у от 0 до минус бесконечности")
# if chetvert == 4: print("Диапазон возможных координат: х от 0 до минус бесконечности, у от 0 до бесконечности")
# else: print("Введите номер четверти от 1 до 4")

# Задача №5. Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.

# print("Введите координаты первой точки:")
# x1 = int(input("Введите значение х1:"))
# у1 = int(input("Введите значение у1:"))
# print("Введите координаты второй точки:")
# x2 = int(input("Введите значение х2:"))
# у2 = int(input("Введите значение у2:"))

# distance = ((x1-x2)**2)+((у1-у2)**2) ** (0.5)
# print(f"Расстояние между точками {distance}")
