# Задача №1. Найти вхождение значения в список.
# my_list = ["6", "45", "2"]
# num = input("Введите искомое число:")

# for i in range(len(my_list)):
#     if num in my_list[i]: #num == my_list[i]:  двойное равно ищет точное совпадение в том числе и по типу данных
#         print(f"число: {num} присутсвтует с индексом: {i}")
#         break
          
# else: print("Нет такого числа")

# Задача №2. Найти второе вхождение значения в список
# my_list = ["привет", "пока", "привет", "пока", "привет"]
# num = input("Введите значение:")
# count =0

# for i in range(len(my_list)):
#     if num == my_list[i]: 
#         count += 1
        
#         if count ==2: 
#             print(f"второе вхождение значение: {num} присутсвтует с индексом: {i}")
#             break        
# else: print("Нет такого значения")